Repository: collective/collective.documentgenerator
Catalog: src/collective/documentgenerator/locales/*/LC_MESSAGES/collective.documentgenerator.po
Languages: fr

source: ${error_message} for key = '${key}'
fr: ${error_message} pour la clé '${key}'

source: A document that holds styles to include into a POD template.
fr: Un document qui contient les styles à incorporer dans un modèle de document POD.

source: A document to generate on a content.
fr: Un document à générer depuis un type de contenu.

source: Allowed portal types
fr: Types de contenu autorisés

source: Available formats
fr: Formats disponibles

source: Bad phone number: '${nb}'
fr: Numéro de téléphone non reconnu: '${nb}'

source: Can't create a persistent document on a non folderish context.
fr: Impossible de créer un document persistant si le contexte n'est pas un conteneur.

source: Can't import python uno library with the python path
fr: L'importation de la librairie UNO dans votre environnement python a échoué

source: Cancel
fr: Annuler

source: Changes saved
fr: Changements enregistrés

source: Check if this POD Template can be reused by other POD Template
fr: Cocher si ce modèle canvas odt peut-être réutilisé dans d'autres modèles de documents POD

source: Choose the mailing loop template to apply for this template.
fr: Sélectionnez le modèle de boucle de publipostage.

source: Choose the style template to apply for this template.
fr: Sélectionnez le fichier de style à utiliser pour ce modèle.

source: Collection template
fr: Modèle collection

source: ConfigurablePODTemplate
fr: Modèle de document POD

source: Context variables.
fr: Variables du contexte

source: Dict update collision on key
fr: Collision dans la mise à jour du dictionnaire

source: Disabled
fr: Désactivé

source: Distribute
fr: Distribuer

source: Do rendering
fr: Pré-rendu

source: Document Generator settings
fr: Configuration du générateur de document

source: Edit cancelled
fr: Édition annulée

source: Enabled
fr: Activé

source: Error when merging context_variables in generation context
fr: Erreur lors de la mise à jour du contexte de génération avec les variables de contexte

source: Error when merging helper_view in generation context
fr: Erreur lors de la mise à jour du contexte de génération avec la vue d'aide

source: Error when merging mailed_data in generation context
fr: Erreur lors de la mise à jour du contexte de génération avec la donnée à publiposter

source: Error when merging mailing_list in generation context
fr: Erreur lors de la mise à jour du contexte de génération avec les données à publiposter

source: Error when merging merge_templates in generation context
fr: Erreur lors de la mise à jour du contexte de génération avec les sous-modèles

source: Force disabled
fr: Désactiver (ignorer la valeur globale)

source: Force distribute
fr: Distribuer (ignorer la valeur globale)

source: Force nothing
fr: Activé mais sans traitement par défaut (ignorer la valeur globale)

source: Force optimize
fr: Optimiser (ignorer la valeur globale)

source: General template
fr: Modèle général

source: Global value (${global_value})
fr: Utiliser la valeur globale (${global_value})

source: Header
fr: En-tête

source: If enabled, this will allow the "table-layout: fixed|auto|none" CSS style handling while generating document. If no such style is defined on the table, the chosen column modifier of LibreOffice will be applied.
fr: Si activé, ceci autorisera le traitement des styles CSS "table-layout: fixed|auto|none" lors de la génération de document. Si aucun style n'est défini sur la table, le traitement de largeur de colonne LibreOffice choisi sera appliqué.

source: If enabled, this will avoid generating a document containing an error, instead a common Plone error will be raised. Nevertheless to ease debugging, Managers will continue to get errors in the generated document if it uses .odt format.
fr: Une fois activé, ceci évite qu'un document contenant une erreur soit généré, à la place, une erreur Plone sera produite. Néanmoins, pour faciliter le déboguage, les administrateurs continueront à obtenir les erreurs dans les documents générés s'ils le sont au format .odt

source: Invalid Python path
fr: Le chemin python spécifié semble erroné

source: Invalid phone number: '${nb}'
fr: Numéro de téléphone non valide: '${nb}'

source: Linked POD Template using this one
fr: Modèle de document POD liés utilisant celui-ci

source: Mailing loop template
fr: Modèle de boucle de publipostage

source: MailingLoopTemplate
fr: Modèle de boucle de publipostage

source: Modified
fr: Modifié

source: Multiple format template
fr: Modèle différents formats

source: No format selected
fr: Aucun format sélectionné

source: None
fr: Aucun

source: Nothing
fr: Activé mais sans traitement par défaut

source: ODT File
fr: Canevas

source: Optimize
fr: Optimiser

source: POD Templates
fr: Modèles POD

source: POD context name
fr: Nom de variable du modèle

source: PODTemplate
fr: Modèle de document POD restreint

source: Path
fr: Chemin relatif

source: Path of python with uno.
fr: Chemin d'un python avec la librairie uno

source: Pod formats
fr: Formats

source: Port Number of OO.
fr: Indiquez le numéro du port sous lequel tourne Libre (ou Open) Office.

source: Possibly mailed template
fr: Modèle qui peut être publiposté

source: Problem during styles update on template '${tmpl}': ${err}
fr: Erreur lors de la mise à jour des styles sur le modèle '${tmpl}': ${err}

source: Raise an error instead generating the document
fr: En cas d'erreur, produire une erreur Plone au lieu d'une erreur dans le document généré

source: Reusable
fr: Réutilisable

source: Reusable template
fr: Modèle réutilisable

source: Reuse Test Template
fr: Modèle utilisant le fichier ODT d'un autre modèle

source: Save
fr: Sauver

source: Select Existing POD Template to reuse
fr: Choisir un modèle de document POD existant à réutiliser

source: Select for which content types the template will be available.
fr: Sélectionnez les types de contenus pour lesquels le modèle sera disponible.

source: Select format in which the template will be generable.
fr: Sélectionnez les formats dans lesquels le modèle pourra être généré.

source: Spreadsheet template
fr: Modèle de tableur

source: Style template
fr: Modèle de style

source: StyleTemplate
fr: Modèle de style

source: SubTemplate
fr: Sous modèle

source: Table column modifier
fr: Modification sur les colonnes de tableaux

source: Template
fr: Modèle

source: Templates to merge.
fr: Modèles à fusionner.

source: These context variables are added to the odt_file context.
fr: Ces variables sont ajoutées au contexte passé au modèle odt.

source: Value
fr: Valeur

source: Variable name
fr: Nom de variable

source: You can't select a POD Template or set this template reusable if you have chosen an existing POD Template.
fr: Vous ne pouvez pas définir un 'Canevas' ou définir ce modèle comme 'Réutilisable' si vous avez choisi un modèle dans la liste 'Choisir un modèle de document POD existant à réutiliser'.

source: You can't use one of these words: ${list}
fr: Vous ne pouvez pas utiliser un de ces noms réservés: ${list}

source: You have twice used the same name '${name}'
fr: Vous avez déclaré 2 fois le même nom de variable: ${list}

source: You must select an odt file or an existing pod template
fr: Un des champs 'Canevas' ou 'Choisir un modèle de document POD existant à réutiliser' doit être rempli.

source: comment
fr: Commentaire

source: element_not_valid
fr: L'élément ${elem} est invalide pour l'extension .${extension} de votre canevas "${template}"

source: input_field
fr: Champs de saisie

source: last_change
fr: Dernière modification

source: oo_port
fr: Numéro du port Office

source: uno path
fr: Python uno
